app/Models/MatchesModel.php

INSERT INTO `pl6_matches` (`series_id`, `cricks_id`, `crickm_id`, `teama_key`, `teamb_key`, `title`, `teama_id`, `teamb_id`, `utc_starttime`, `utc_endtime`, `status`, `match_type`, `name`, `season_id`, `date_created`, `date_updated`) VALUES ('110', 311, 66062, '1688', '1335', '6th Match', '542', '543', '2025-04-14 06:45:00', '2025-04-14 08:15:00', '1', '2', 'European Cricket Series Bologna', 1720, '2025-04-13 15:30:32', '2025-04-13 15:30:32')
---
    public function createMatch($data)
    {

      $builder = $this->db->table($this->matchesTbl);

      $builder->set('series_id', $data['seriesId']);
      $builder->set('cricks_id', $data['cricksId']);
      $builder->set('crickm_id', $data['crickmId']);
      $builder->set('teama_key', $data['teamaKey']);
      $builder->set('teamb_key', $data['teambKey']);
      $builder->set('title', $data['title']);
      $builder->set('teama_id', $data['teamaId']);
      $builder->set('teamb_id', $data['teambId']);
      $builder->set('utc_starttime', $data['starttime']);
      $builder->set('utc_endtime', $data['endtime']);
      $builder->set('status', $data['status']);
      $builder->set('match_type', $data['matchType']);
      $builder->set('name', $data['name']);
      $builder->set('season_id', $data['seasonId']);

      $builder->set('date_created', gmdate("Y-m-d H:i:s"));
      $builder->set('date_updated', gmdate("Y-m-d H:i:s"));

      return $builder->insert();

SELECT `id` as `id`, `series_id` as `seriesId`, `cricks_id` as `cricksId`, `crickm_id` as `crickmId`, `teama_key` as `teamaKey`, `teamb_key` as `teambKey`, `title` as `title`, `teama_id` as `teamaId`, `teamb_id` as `teambId`, `utc_starttime` as `startTime`, `utc_endtime` as `endTime`, `toss_time` as `tossTime`, `status` as `status`, `name` as `name`, `season_id` as `seasonId`, `match_type` as `matchType`
FROM `pl6_matches`
WHERE `crickm_id` = 66007
 LIMIT 1
---
    public function checkMatchExist($matchkey)
    {

      $builder = $this->db->table($this->matchesTbl);

      $builder->select('id as id');
      $builder->select('series_id as seriesId');
      $builder->select('cricks_id as cricksId');
      $builder->select('crickm_id as crickmId');
      $builder->select('teama_key as teamaKey');
      $builder->select('teamb_key as teambKey');
      $builder->select('title as title');
      $builder->select('teama_id as teamaId');
      $builder->select('teamb_id as teambId');
      $builder->select('utc_starttime as startTime');
      $builder->select('utc_endtime as endTime');
      $builder->select('toss_time as tossTime');
      $builder->select('status as status');
      $builder->select('name as name');
      $builder->select('season_id as seasonId');
      $builder->select('match_type as matchType');

      $builder->where('crickm_id', $matchkey);
      $builder->limit(1);

      $query = $builder->get();

SELECT `id` as `matchId`, `series_id` as `seriesId`, `cricks_id` as `cricksId`, `crickm_id` as `crickmId`, `teama_key` as `teamaKey`, `teamb_key` as `teambKey`, `title` as `title`, `name` as `name`, `season_id` as `seasonId`, `match_type` as `matchType`, `teama_id` as `teamaId`, `teamb_id` as `teambId`, `has_players` as `hasPlayers`, `utc_starttime` as `startTime`, `utc_endtime` as `endTime`
FROM `pl6_matches`
WHERE `status` = '1'
AND `utc_starttime` >= '2025-04-17 00:00:00'
AND `utc_starttime` < '2025-04-18 23:59:59'
ORDER BY `utc_starttime` ASC
---
    public function getOnGoingMatches($startTime,$endTime)
    {
      $builder = $this->db->table($this->matchesTbl);

      $builder->select('id as matchId');
      $builder->select('series_id as seriesId');
      $builder->select('cricks_id as cricksId');
      $builder->select('crickm_id as crickmId');
      $builder->select('teama_key as teamaKey');
      $builder->select('teamb_key as teambKey');
      $builder->select('title as title');
      $builder->select('name as name');
      $builder->select('season_id as seasonId');
      $builder->select('match_type as matchType');
      $builder->select('teama_id as teamaId');
      $builder->select('teamb_id as teambId');
      $builder->select('has_players as hasPlayers');
      $builder->select('utc_starttime as startTime');
      $builder->select('utc_endtime as endTime');

      $builder->where('status', '1');
      $builder->where('utc_starttime >=', $startTime);
      $builder->where('utc_starttime <', $endTime);
      $builder->orderBy('utc_starttime', 'ASC');

      $query = $builder->get();

SELECT `id` as `matchId`, `series_id` as `seriesId`, `cricks_id` as `cricksId`, `crickm_id` as `crickmId`, `teama_key` as `teamaKey`, `teamb_key` as `teambKey`, `title` as `title`, `name` as `name`, `season_id` as `seasonId`, `teama_id` as `teamaId`, `teamb_id` as `teambId`, `utc_starttime` as `startTime`, `utc_endtime` as `endTime`
FROM `pl6_matches`
WHERE `has_players` = '0'
AND `utc_starttime` >= '2025-04-04 00:00:00'
AND `utc_starttime` <= '2025-04-05 23:59:59'
ORDER BY `utc_starttime` ASC
---
    public function getNoPlayerMatches($startTime,$endTime)
    {
      $builder = $this->db->table($this->matchesTbl);

      $builder->select('id as matchId');
      $builder->select('series_id as seriesId');
      $builder->select('cricks_id as cricksId');
      $builder->select('crickm_id as crickmId');
      $builder->select('teama_key as teamaKey');
      $builder->select('teamb_key as teambKey');
      $builder->select('title as title');
      $builder->select('name as name');
      $builder->select('season_id as seasonId');
      $builder->select('teama_id as teamaId');
      $builder->select('teamb_id as teambId');
      $builder->select('utc_starttime as startTime');
      $builder->select('utc_endtime as endTime');

      $builder->where('has_players', '0');
      $builder->where('utc_starttime >=', $startTime);
      $builder->where('utc_starttime <=', $endTime);
      $builder->orderBy('utc_starttime', 'ASC');

      $query = $builder->get();