app/Models/MatchesLookupModel.php

INSERT INTO `pl6_matches_lookup` (`match_id`, `cricks_id`, `crickm_id`, `teama_key`, `teamb_key`, `teama_id`, `teamb_id`, `match_type`, `utc_starttime`, `utc_endtime`, `date_created`, `date_updated`) VALUES ('2648', '47', '64863', '93', '95', '43', '36', '3', '2025-04-18 10:00:00', '2025-04-23 10:00:00', '2025-04-17 06:30:33', '2025-04-17 06:30:33')
---
    public function createMatchLookup($data)
    {

      $builder = $this->db->table($this->matchesTbl);

      $builder->set('match_id', $data['matchId']);
      $builder->set('cricks_id', $data['cricksId']);
      $builder->set('crickm_id', $data['crickmId']);
      $builder->set('teama_key', $data['teamaKey']);
      $builder->set('teamb_key', $data['teambKey']);
      $builder->set('teama_id', $data['teamaId']);
      $builder->set('teamb_id', $data['teambId']);
      $builder->set('match_type', $data['matchType']);
      $builder->set('utc_starttime', $data['starttime']);
      $builder->set('utc_endtime', $data['endtime']);


      $builder->set('date_created', gmdate("Y-m-d H:i:s"));
      $builder->set('date_updated', gmdate("Y-m-d H:i:s"));

      return $builder->insert();