app/Models/SeriesModel.php

    public function checkSeriesExist($crickey)
    {

      $builder = $this->db->table($this->seriesTbl);

      $builder->select('id as seriesId');
      $builder->select('crick_id as crickSeriesId');
      $builder->select('name as name');
      $builder->select('short_name as SName');
      $builder->select('date as date');
      $builder->select('status as status');
      $builder->select('type as type');

      $builder->where('crick_id', $crickey);
      $builder->limit(1);

      $query = $builder->get();
---
SELECT `id` as `seriesId`, `crick_id` as `crickSeriesId`, `name` as `name`, `short_name` as `SName`, `date` as `date`, `status` as `status`, `type` as `type`
FROM `pl6_series`
WHERE `crick_id` = 59
 LIMIT 1