app/Models/TeamsModel.php

    public function createTeam($data){

      $builder = $this->db->table($this->teamsTbl);

      $builder->set('crickt_id', $data['cricktId']);
      $builder->set('name', $data['name']);
      $builder->set('short_name', $data['shortName']);
      $builder->set('logo', $data['logo']);
      $builder->set('date_created', gmdate("Y-m-d H:i:s"));
      $builder->set('date_updated', gmdate("Y-m-d H:i:s"));

      return $builder->insert();
---
INSERT INTO `pl6_teams` (`crickt_id`, `name`, `short_name`, `logo`, `date_created`, `date_updated`) VALUES (1688, 'Trentino Aquila', 'TRA', '24/1688.png', '2025-04-13 15:30:32', '2025-04-13 15:30:32')

    public function checkTeamExist($crickey)
    {

      $builder = $this->db->table($this->teamsTbl);

      $builder->select('id as teamId');
      $builder->select('crickt_id as crickTeamId');
      $builder->select('name as name');
      $builder->select('short_name as shortName');
      $builder->select('logo as logo');

      $builder->where('crickt_id', $crickey);
      $builder->limit(1);

      $query = $builder->get();
---
SELECT `id` as `teamId`, `crickt_id` as `crickTeamId`, `name` as `name`, `short_name` as `shortName`, `logo` as `logo`
FROM `pl6_teams`
WHERE `crickt_id` = 708
 LIMIT 1